---
kind: type
id: T:Autodesk.Revit.DB.ShapeImporterSourceFormat
source: html/556c092a-0afa-c38e-c784-3d9d919dc220.htm
---
# Autodesk.Revit.DB.ShapeImporterSourceFormat

An enumerated type listing the possible formats supported by the Shapeimporter.

## Syntax (C#)
```csharp
public enum ShapeImporterSourceFormat
```